Bololololololo/wolfBoot_esp32s3/hal/spi/spi_drv_esp32s3.h
typedef enum
{
    ESP_ROM_SPIFLASH_QIO_MODE = 0,
    ESP_ROM_SPIFLASH_QOUT_MODE,
    ESP_ROM_SPIFLASH_DIO_MODE,
    ESP_ROM_SPIFLASH_DOUT_MODE,
    ESP_ROM_SPIFLASH_FASTRD_MODE,
    ESP_ROM_SPIFLASH_SLOWRD_MODE,
    ESP_ROM_SPIFLASH_OPI_STR_MODE,
    ESP_ROM_SPIFLASH_OPI_DTR_MODE,
    ESP_ROM_SPIFLASH_OOUT_MODE,
    ESP_ROM_SPIFLASH_OIO_STR_MODE,
    ESP_ROM_SPIFLASH_OIO_DTR_MODE,
    ESP_ROM_SPIFLASH_QPI_MODE,
    ESP_ROM_SPIFLASH_OPI_HEX_DTR_MODE,
} esp_rom_spiflash_read_mode_t;

typedef enum
{
    ESP_ROM_SPIFLASH_RESULT_OK,
    ESP_ROM_SPIFLASH_RESULT_ERR,
    ESP_ROM_SPIFLASH_RESULT_TIMEOUT
} esp_rom_spiflash_result_t;

typedef struct
{
    uint32_t device_id;
    uint32_t chip_size; // chip size in bytes
    uint32_t block_size;
    uint32_t sector_size;
    uint32_t page_size;
    uint32_t status_mask;
} esp_rom_spiflash_chip_t;

typedef struct
{
    esp_rom_spiflash_chip_t chip;
    uint8_t dummy_len_plus[3];
    uint8_t sig_matrix;
} esp_rom_spiflash_legacy_data_t;

typedef volatile struct spi_mem_dev_s
{
    union
    {
        struct
        {
            uint32_t reserved0 : 17; /*reserved*/
            uint32_t flash_pe : 1;   /*In user mode, it is set to indicate that program/erase operation will be triggered. The bit is combined with SPI_MEM_USR bit. The bit will be cleared once the operation done.1: enable 0: disable. */
            uint32_t usr : 1;        /*User define command enable.  An operation will be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable. */
            uint32_t flash_hpm : 1;  /*Drive Flash into high performance mode.  The bit will be cleared once the operation done.1: enable 0: disable. */
            uint32_t flash_res : 1;  /*This bit combined with SPI_MEM_RESANDRES bit releases Flash from the power-down state or high performance mode and obtains the devices ID. The bit will be cleared once the operation done.1: enable 0: disable. */
            uint32_t flash_dp : 1;   /*Drive Flash into power down.  An operation will be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable. */
            uint32_t flash_ce : 1;   /*Chip erase enable. Chip erase operation will be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable. */
            uint32_t flash_be : 1;   /*Block erase enable(32KB) .  Block erase operation will be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable. */
            uint32_t flash_se : 1;   /*Sector erase enable(4KB). Sector erase operation will be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable. */
            uint32_t flash_pp : 1;   /*Page program enable(1 byte ~64 bytes data to be programmed). Page program operation  will be triggered when the bit is set. The bit will be cleared once the operation done .1: enable 0: disable. */
            uint32_t flash_wrsr : 1; /*Write status register enable.   Write status operation  will be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable. */
            uint32_t flash_rdsr : 1; /*Read status register-1.  Read status operation will be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable. */
            uint32_t flash_rdid : 1; /*Read JEDEC ID . Read ID command will be sent when the bit is set. The bit will be cleared once the operation done. 1: enable 0: disable. */
            uint32_t flash_wrdi : 1; /*Write flash disable. Write disable command will be sent when the bit is set. The bit will be cleared once the operation done. 1: enable 0: disable. */
            uint32_t flash_wren : 1; /*Write flash enable.  Write enable command will be sent when the bit is set. The bit will be cleared once the operation done. 1: enable 0: disable. */
            uint32_t flash_read : 1; /*Read flash enable. Read flash operation will be triggered when the bit is set. The bit will be cleared once the operation done. 1: enable 0: disable. */
        };
        uint32_t val;
    } cmd;
    uint32_t addr;
    union
    {
        struct
        {
            uint32_t reserved0 : 3;   /*reserved*/
            uint32_t fdummy_out : 1;  /*In the DUMMY phase the signal level of SPI bus is output by the SPI0 controller.*/
            uint32_t fdout_oct : 1;   /*Set this bit to enable 8-bit-mode(8-bm) in DOUT phase.*/
            uint32_t fdin_oct : 1;    /*Set this bit to enable 8-bit-mode(8-bm) in DIN phase.*/
            uint32_t faddr_oct : 1;   /*Set this bit to enable 8-bit-mode(8-bm) in ADDR phase.*/
            uint32_t fcmd_dual : 1;   /*Set this bit to enable 2-bit-mode(2-bm) in CMD phase.*/
            uint32_t fcmd_quad : 1;   /*Set this bit to enable 4-bit-mode(4-bm) in CMD phase.*/
            uint32_t fcmd_oct : 1;    /*Set this bit to enable 8-bit-mode(8-bm) in CMD phase.*/
            uint32_t fcs_crc_en : 1;  /*For SPI1,  initialize crc32 module before writing encrypted data to flash. Active low.*/
            uint32_t tx_crc_en : 1;   /*For SPI1,  enable crc32 when writing encrypted data to flash. 1: enable 0:disable*/
            uint32_t reserved12 : 1;  /*reserved*/
            uint32_t fastrd_mode : 1; /*This bit should be set when SPI_MEM_FREAD_QIO, SPI_MEM_FREAD_DIO, SPI_MEM_FREAD_QUAD or SPI_MEM_FREAD_DUAL is set.*/
            uint32_t fread_dual : 1;  /*In hardware 0x3B read operation, DIN phase apply 2 signals. 1: enable 0: disable. */
            uint32_t resandres : 1;   /*The Device ID is read out to SPI_MEM_RD_STATUS register,  this bit combine with spi_mem_flash_res bit. 1: enable 0: disable. */
            uint32_t reserved16 : 2;  /*reserved*/
            uint32_t q_pol : 1;       /*The bit is used to set MISO line polarity, 1: high 0, low*/
            uint32_t d_pol : 1;       /*The bit is used to set MOSI line polarity, 1: high 0, low*/
            uint32_t fread_quad : 1;  /*In hardware 0x6B read operation, DIN phase apply 4 signals(4-bit-mode). 1: enable 0: disable. */
            uint32_t wp : 1;          /*Write protect signal output when SPI is idle.  1: output high, 0: output low. */
            uint32_t wrsr_2b : 1;     /*Two bytes data will be written to status register when it is set. 1: enable 0: disable. */
            uint32_t fread_dio : 1;   /*In hardware 0xBB read operation, ADDR phase and DIN phase apply 2 signals(2-bit-mode). 1: enable 0: disable. */
            uint32_t fread_qio : 1;   /*In hardware 0xEB read operation, ADDR phase and DIN phase apply 4 signals(4-bit-mode). 1: enable 0: disable. */
            uint32_t reserved25 : 7;  /*reserved*/
        };
        uint32_t val;
    } ctrl;
    union
    {
        struct
        {
            uint32_t clk_mode : 2;         /*SPI Bus clock (SPI_CLK) mode bits. 0: SPI Bus clock (SPI_CLK) is off when CS inactive 1: SPI_CLK is delayed one cycle after SPI_CS inactive 2: SPI_CLK is delayed two cycles after SPI_CS inactive 3: SPI_CLK is always on.*/
            uint32_t cs_hold_dly_res : 10; /*After RES/DP/HPM/PES/PER command is sent, SPI1 may waits (SPI_MEM_CS_HOLD_DELAY_RES[9:0] * 4 or * 256) SPI_CLK cycles.*/
            uint32_t reserved2 : 18;       /*reserved*/
            uint32_t rxfifo_rst : 1;       /*SPI0 RX FIFO reset signal. Set this bit and clear it before SPI0 transfer starts.*/
            uint32_t reserved31 : 1;       /*reserved*/
        };
        uint32_t val;
    } ctrl1;
    union
    {
        struct
        {
            uint32_t cs_setup_time : 5;        /*(cycles-1) of PREP phase by SPI_CLK, which is the SPI_CS setup time. These bits are combined with SPI_MEM_CS_SETUP bit.*/
            uint32_t cs_hold_time : 5;         /*SPI Bus CS (SPI_CS) signal is delayed to inactive by SPI Bus clock (SPI_CLK), which is the SPI_CS hold time in non-ECC mode. These bits are combined with SPI_MEM_CS_HOLD bit.*/
            uint32_t ecc_cs_hold_time : 3;     /*SPI_MEM_CS_HOLD_TIME + SPI_MEM_ECC_CS_HOLD_TIME is the SPI_CS hold cycle in ECC mode when accessed flash.*/
            uint32_t ecc_skip_page_corner : 1; /*1: MSPI skips page corner when accesses flash. 0: Not skip page corner when accesses flash.*/
            uint32_t ecc_16to18_byte_en : 1;   /*Set this bit to enable MSPI ECC 16 bytes data with 2 ECC bytes mode when accesses flash.*/
            uint32_t reserved15 : 10;          /*reserved*/
            uint32_t cs_hold_delay : 6;        /*These bits are used to set the minimum CS high time tSHSL between SPI burst transfer when accesses to flash. tSHSL is (SPI_MEM_CS_HOLD_DELAY[5:0] + 1) MSPI core clock cycles.*/
            uint32_t sync_reset : 1;           /*The FSM will be reset.*/
        };
        uint32_t val;
    } ctrl2;
    union
    {
        struct
        {
            uint32_t clkcnt_l : 8;       /*It must equal to the value of SPI_MEM_CLKCNT_N. */
            uint32_t clkcnt_h : 8;       /*It must be a floor value of ((SPI_MEM_CLKCNT_N+1)/2-1).*/
            uint32_t clkcnt_n : 8;       /*When SPI0 accesses flash, f_SPI_CLK = f_MSPI_CORE_CLK/(SPI_MEM_CLKCNT_N+1)*/
            uint32_t reserved24 : 7;     /*reserved*/
            uint32_t clk_equ_sysclk : 1; /*When SPI0 accesses flash, set this bit in 1-division mode, f_SPI_CLK = f_MSPI_CORE_CLK.*/
        };
        uint32_t val;
    } clock;
    union
    {
        struct
        {
            uint32_t reserved0 : 6;         /*reserved*/
            uint32_t cs_hold : 1;           /*Set this bit to keep SPI_CS low when MSPI is in DONE state.*/
            uint32_t cs_setup : 1;          /*Set this bit to keep SPI_CS low when MSPI is in PREP state.*/
            uint32_t reserved8 : 1;         /*reserved*/
            uint32_t ck_out_edge : 1;       /*This bit, combined with SPI_MEM_CK_IDLE_EDGE bit, is used to change the clock mode 0~3 of SPI_CLK. */
            uint32_t reserved10 : 2;        /*reserved*/
            uint32_t fwrite_dual : 1;       /*Set this bit to enable 2-bm in DOUT phase in SPI1 write operation.*/
            uint32_t fwrite_quad : 1;       /*Set this bit to enable 4-bm in DOUT phase in SPI1 write operation.*/
            uint32_t fwrite_dio : 1;        /*Set this bit to enable 2-bm in ADDR and DOUT phase in SPI1 write operation.*/
            uint32_t fwrite_qio : 1;        /*Set this bit to enable 4-bit-mode(4-bm) in ADDR and DOUT phase in SPI1 write operation.*/
            uint32_t reserved16 : 8;        /*reserved*/
            uint32_t usr_miso_highpart : 1; /*DIN phase only access to high-part of the buffer SPI_MEM_W8_REG~SPI_MEM_W15_REG. 1: enable 0: disable. */
            uint32_t usr_mosi_highpart : 1; /*DOUT phase only access to high-part of the buffer SPI_MEM_W8_REG~SPI_MEM_W15_REG. 1: enable 0: disable. */
            uint32_t usr_dummy_idle : 1;    /*SPI_CLK is disabled(No clock edges) in DUMMY phase when the bit is enable.*/
            uint32_t usr_mosi : 1;          /*Set this bit to enable the DOUT phase of an write-data operation.*/
            uint32_t usr_miso : 1;          /*Set this bit to enable enable the DIN phase of a read-data operation.*/
            uint32_t usr_dummy : 1;         /*Set this bit to enable enable the DUMMY phase of an operation.*/
            uint32_t usr_addr : 1;          /*Set this bit to enable enable the ADDR phase of an operation.*/
            uint32_t usr_command : 1;       /*Set this bit to enable enable the CMD phase of an operation.*/
        };
        uint32_t val;
    } user;
    union
    {
        struct
        {
            uint32_t usr_dummy_cyclelen : 6; /*The SPI_CLK cycle length minus 1 of DUMMY phase.*/
            uint32_t reserved6 : 20;         /*reserved*/
            uint32_t usr_addr_bitlen : 6;    /*The length in bits of ADDR phase. The register value shall be (bit_num-1).*/
        };
        uint32_t val;
    } user1;
    union
    {
        struct
        {
            uint32_t usr_command_value : 16; /*The value of user defined(USR) command.*/
            uint32_t reserved16 : 12;        /*reserved*/
            uint32_t usr_command_bitlen : 4; /*The length in bits of CMD phase. The register value shall be (bit_num-1)*/
        };
        uint32_t val;
    } user2;
    union
    {
        struct
        {
            uint32_t usr_mosi_bit_len : 10; /*The length in bits of DOUT phase. The register value shall be (bit_num-1).*/
            uint32_t reserved10 : 22;       /*reserved*/
        };
        uint32_t val;
    } mosi_dlen;
    union
    {
        struct
        {
            uint32_t usr_miso_bit_len : 10; /*The length in bits of DIN phase. The register value shall be (bit_num-1).*/
            uint32_t reserved10 : 22;       /*reserved*/
        };
        uint32_t val;
    } miso_dlen;
    union
    {
        struct
        {
            uint32_t status : 16;    /*The value is stored when set SPI_MEM_FLASH_RDSR bit and SPI_MEM_FLASH_RES bit.*/
            uint32_t wb_mode : 8;    /*Mode bits in the flash fast read mode  it is combined with SPI_MEM_FASTRD_MODE bit.*/
            uint32_t reserved24 : 8; /*reserved*/
        };
        uint32_t val;
    } rd_status;
    uint32_t ext_addr;
    union
    {
        struct
        {
            uint32_t cs0_dis : 1;        /*Set this bit to raise high SPI_CS pin, which means that the SPI device(flash) connected to SPI_CS is in low level when SPI1 transfer starts.*/
            uint32_t cs1_dis : 1;        /*Set this bit to raise high SPI_CS1 pin, which means that the SPI device(Ext_RAM) connected to SPI_CS1 is in low level when SPI1 transfer starts.*/
            uint32_t reserved0 : 5;      /*reserved*/
            uint32_t fsub_pin : 1;       /*Flash is connected to SPI SUBPIN bus.*/
            uint32_t ssub_pin : 1;       /*Ext_RAM is connected to SPI SUBPIN bus.*/
            uint32_t ck_idle_edge : 1;   /*1: SPI_CLK line is high when idle. 0: SPI_CLK line is low when idle */
            uint32_t cs_keep_active : 1; /*SPI_CS line keep low when the bit is set.*/
            uint32_t auto_per : 1;       /*Set this bit to enable auto PER function. Hardware will sent out PER command if PES command is sent.*/
            uint32_t reserved12 : 20;    /*reserved*/
        };
        uint32_t val;
    } misc;
    uint32_t tx_crc;
    union
    {
        struct
        {
            uint32_t req_en : 1;        /*Set this bit to enable Cache's access and SPI0's transfer.*/
            uint32_t usr_cmd_4byte : 1; /*Set this bit to enable SPI0 read flash with 32 bits address. The value of SPI_MEM_USR_ADDR_BITLEN should be 31.*/
            uint32_t flash_usr_cmd : 1; /*1: The command value of SPI0 reads flash is SPI_MEM_USR_COMMAND_VALUE. 0: Hardware read command value, controlled by SPI_MEM_FREAD_QIO, SPI_MEM_FREAD_DIO, SPI_MEM_FREAD_QUAD, SPI_MEM_FREAD_DUAL and SPI_MEM_FASTRD_MODE bits.*/
            uint32_t fdin_dual : 1;     /*When SPI0 accesses to flash, set this bit to enable 2-bm in DIN phase.*/
            uint32_t fdout_dual : 1;    /*When SPI0 accesses to flash, set this bit to enable 2-bm in DOUT phase.*/
            uint32_t faddr_dual : 1;    /*When SPI0 accesses to flash, set this bit to enable 2-bm in ADDR phase.*/
            uint32_t fdin_quad : 1;     /*When SPI0 accesses to flash, set this bit to enable 4-bm in DIN phase.*/
            uint32_t fdout_quad : 1;    /*When SPI0 accesses to flash, set this bit to enable 4-bm in DOUT phase.*/
            uint32_t faddr_quad : 1;    /*When SPI0 accesses to flash, set this bit to enable 4-bm in ADDR phase.*/
            uint32_t reserved9 : 23;    /*reserved*/
        };
        uint32_t val;
    } cache_fctrl;
    union
    {
        struct
        {
            uint32_t usr_scmd_4byte : 1;       /*Set this bit to enable SPI0 read Ext_RAM with 32 bits address. The value of SPI_MEM_SRAM_ADDR_BITLEN should be 31.*/
            uint32_t usr_sram_dio : 1;         /*Set the bit to enable 2-bm in all the phases of SPI0 Ext_RAM transfer.*/
            uint32_t usr_sram_qio : 1;         /*Set the bit to enable QPI mode in all SPI0 Ext_RAM transfer.*/
            uint32_t usr_wr_sram_dummy : 1;    /*When SPI0 accesses to Ext_RAM, set this bit to enable DUMMY phase in write operations.*/
            uint32_t usr_rd_sram_dummy : 1;    /*When SPI0 accesses to Ext_RAM, set this bit to enable DUMMY phase in read operations.*/
            uint32_t usr_rcmd : 1;             /*1: The command value of SPI0 read Ext_RAM is SPI_MEM_CACHE_SRAM_USR_WR_CMD_VALUE. 0: The value is 0x2.*/
            uint32_t sram_rdummy_cyclelen : 6; /*When SPI0 accesses to Ext_RAM, it is the SPI_CLK cycles minus 1 of DUMMY phase in read data transfer.*/
            uint32_t reserved12 : 2;           /*reserved*/
            uint32_t sram_addr_bitlen : 6;     /*When SPI0 accesses to Ext_RAM, it is the length in bits of ADDR phase. The register value shall be (bit_num-1).*/
            uint32_t usr_wcmd : 1;             /*1: The command value of SPI0 write Ext_RAM is SPI_MEM_CACHE_SRAM_USR_RD_CMD_VALUE. 0: The value is 0x3.*/
            uint32_t sram_oct : 1;             /*Set the bit to enable OPI mode in all SPI0 Ext_RAM transfer.*/
            uint32_t sram_wdummy_cyclelen : 6; /*When SPI0 accesses to Ext_RAM, it is the SPI_CLK cycles minus 1 of DUMMY phase in write data transfer.*/
            uint32_t reserved28 : 4;           /*reserved*/
        };
        uint32_t val;
    } cache_sctrl;
    union
    {
        struct
        {
            uint32_t sclk_mode : 2;  /*SPI_CLK mode bits  when SPI0 accesses to Ext_RAM. 0: SPI_CLK is off when CS inactive 1: SPI_CLK is delayed one cycle after CS inactive 2: SPI_CLK is delayed two cycles after CS inactive 3: SPI_CLK is always on.*/
            uint32_t swb_mode : 8;   /*Mode bits when SPI0 accesses to Ext_RAM.*/
            uint32_t sdin_dual : 1;  /*When SPI0 accesses to Ext_RAM, set this bit to enable 2-bm in DIN phase.*/
            uint32_t sdout_dual : 1; /*When SPI0 accesses to Ext_RAM, set this bit to enable 2-bm in DOUT phase.*/
            uint32_t saddr_dual : 1; /*When SPI0 accesses to Ext_RAM, set this bit to enable 2-bm in ADDR phase.*/
            uint32_t scmd_dual : 1;  /*When SPI0 accesses to Ext_RAM, set this bit to enable 2-bm in CMD phase.*/
            uint32_t sdin_quad : 1;  /*When SPI0 accesses to Ext_RAM, set this bit to enable 4-bm in DIN phase.*/
            uint32_t sdout_quad : 1; /*When SPI0 accesses to Ext_RAM, set this bit to enable 4-bm in DOUT phase.*/
            uint32_t saddr_quad : 1; /*When SPI0 accesses to Ext_RAM, set this bit to enable 4-bm in ADDR phase.*/
            uint32_t scmd_quad : 1;  /*When SPI0 accesses to Ext_RAM, set this bit to enable 4-bm in CMD phase.*/
            uint32_t sdin_oct : 1;   /*When SPI0 accesses to Ext_RAM, set this bit to enable 8-bm in DIN phase.*/
            uint32_t sdout_oct : 1;  /*When SPI0 accesses to Ext_RAM, set this bit to enable 8-bm in DOUT phase.*/
            uint32_t saddr_oct : 1;  /*When SPI0 accesses to Ext_RAM, set this bit to enable 8-bm in ADDR phase.*/
            uint32_t scmd_oct : 1;   /*When SPI0 accesses to Ext_RAM, set this bit to enable 8-bm in CMD phase.*/
            uint32_t sdummy_out : 1; /*When SPI0 accesses to Ext_RAM, in the DUMMY phase the signal level of SPI bus is output by the SPI0 controller.*/
            uint32_t reserved23 : 9; /*reserved*/
        };
        uint32_t val;
    } sram_cmd;
    union
    {
        struct
        {
            uint32_t usr_rd_cmd_value : 16; /*When SPI0 reads Ext_RAM, it is the command value of CMD phase.*/
            uint32_t reserved16 : 12;       /*reserved*/
            uint32_t usr_rd_cmd_bitlen : 4; /*When SPI0 reads Ext_RAM, it is the length in bits of CMD phase. The register value shall be (bit_num-1).*/
        };
        uint32_t val;
    } sram_drd_cmd;
    union
    {
        struct
        {
            uint32_t usr_wr_cmd_value : 16; /*When SPI0 writes Ext_RAM, it is the command value of CMD phase.*/
            uint32_t reserved16 : 12;       /*reserved*/
            uint32_t usr_wr_cmd_bitlen : 4; /*When SPI0 writes Ext_RAM, it is the length in bits of CMD phase. The register value shall be (bit_num-1).*/
        };
        uint32_t val;
    } sram_dwr_cmd;
    union
    {
        struct
        {
            uint32_t cnt_l : 8;      /*It must equal to the value of SPI_MEM_SCLKCNT_N. */
            uint32_t cnt_h : 8;      /*It must be a floor value of ((SPI_MEM_SCLKCNT_N+1)/2-1).*/
            uint32_t cnt_n : 8;      /*When SPI0 accesses to Ext_RAM, f_SPI_CLK = f_MSPI_CORE_CLK/(SPI_MEM_SCLKCNT_N+1)*/
            uint32_t reserved24 : 7; /*reserved*/
            uint32_t equ_sysclk : 1; /*When SPI0 accesses to Ext_RAM, set this bit in 1-division mode, f_SPI_CLK = f_MSPI_CORE_CLK.*/
        };
        uint32_t val;
    } sram_clk;
    union
    {
        struct
        {
            uint32_t st : 3;         /*The status of SPI0 state machine. 0: idle state(IDLE), 1: preparation state(PREP), 2: send command state(CMD), 3: send address state(ADDR), 4: red data state(DIN), 5:write data state(DOUT), 6: wait state(DUMMY), 7: done state(DONE).*/
            uint32_t reserved3 : 29; /*reserved*/
        };
        uint32_t val;
    } fsm;
    uint32_t data_buf[16]; /*data buffer*/
    union
    {
        struct
        {
            uint32_t waiti_en : 1;             /*Set this bit to enable auto-waiting flash idle operation when PP/SE/BE/CE/WRSR/PES command is sent.*/
            uint32_t waiti_dummy : 1;          /*Set this bit to enable DUMMY phase in auto wait flash idle transfer(RDSR).*/
            uint32_t waiti_cmd : 8;            /*The command value of auto wait flash idle transfer(RDSR).*/
            uint32_t waiti_dummy_cyclelen : 6; /*The dummy cycle length when wait flash idle(RDSR).*/
            uint32_t reserved16 : 16;          /*reserved*/
        };
        uint32_t val;
    } flash_waiti_ctrl;
    union
    {
        struct
        {
            uint32_t flash_per : 1;         /*program erase resume bit, program erase suspend operation will be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable. */
            uint32_t flash_pes : 1;         /*program erase suspend bit, program erase suspend operation will be triggered when the bit is set. The bit will be cleared once the operation done.1: enable 0: disable. */
            uint32_t flash_per_wait_en : 1; /*Set this bit to add delay time after program erase resume(PER) is sent.*/
            uint32_t flash_pes_wait_en : 1; /*Set this bit to add delay time after program erase suspend(PES) command is sent.*/
            uint32_t pes_per_en : 1;        /*Set this bit to enable PES transfer trigger PES transfer option.*/
            uint32_t pesr_idle_en : 1;      /*1: Separate PER flash wait idle and PES flash wait idle. 0: Not separate.*/
            uint32_t reserved6 : 26;        /*reserved*/
        };
        uint32_t val;
    } flash_sus_cmd;
    union
    {
        struct
        {
            uint32_t flash_pes_en : 1;      /*Set this bit to enable auto-suspend function.*/
            uint32_t flash_per_command : 8; /*Program/Erase resume command value.*/
            uint32_t flash_pes_command : 8; /*Program/Erase suspend command value.*/
            uint32_t reserved17 : 15;       /*reserved*/
        };
        uint32_t val;
    } flash_sus_ctrl;
    union
    {
        struct
        {
            uint32_t flash_sus : 1;         /*The status of flash suspend. This bit is set when PES command is sent, and cleared when PER is sent. Only used in SPI1.*/
            uint32_t reserved1 : 1;         /*reserved*/
