Bololololololo/wolfBoot_esp32s3/hal/spi/spi_drv_esp32s3.h
unsigned bootloader_read_status_8b_rdsr(void);
unsigned bootloader_read_status_8b_rdsr2(void);
unsigned bootloader_read_status_16b_rdsr_rdsr2(void);
void bootloader_write_status_8b_wrsr(unsigned new_status);
void bootloader_write_status_8b_wrsr2(unsigned new_status);
void bootloader_write_status_16b_wrsr(unsigned new_status);
unsigned bootloader_read_status_8b_xmc25qu64a(void);
void bootloader_write_status_8b_xmc25qu64a(unsigned new_status);

/* Array of known flash chips and data to enable Quad I/O mode

   Manufacturer & flash ID can be tested by running "esptool.py
   flash_id"

   If manufacturer ID matches, and flash ID ORed with flash ID mask
   matches, enable_qio_mode() will execute "Read Cmd", test if bit
   number "QIE Bit" is set, and if not set it will call "Write Cmd"
   with this bit set.

   Searching of this table stops when the first match is found.
 */
const DRAM_ATTR bootloader_qio_info_t __attribute__((weak)) bootloader_flash_qe_support_list[] = {
    /*   Manufacturer,   mfg_id, flash_id, id mask, Read Status,                Write Status,               QIE Bit */
    {"MXIC", 0xC2, 0x2000, 0xFF00, bootloader_read_status_8b_rdsr, bootloader_write_status_8b_wrsr, 6},
    {"ISSI", 0x9D, 0x4000, 0xCF00, bootloader_read_status_8b_rdsr, bootloader_write_status_8b_wrsr, 6}, /* IDs 0x40xx, 0x70xx */
    {"WinBond", 0xEF, 0x4000, 0xFF00, bootloader_read_status_16b_rdsr_rdsr2, bootloader_write_status_16b_wrsr, 9},
    {"GD", 0xC8, 0x6000, 0xFF00, bootloader_read_status_16b_rdsr_rdsr2, bootloader_write_status_16b_wrsr, 9},
    {"XM25QU64A", 0x20, 0x3817, 0xFFFF, bootloader_read_status_8b_xmc25qu64a, bootloader_write_status_8b_xmc25qu64a, 6},
    {"TH", 0xcd, 0x6000, 0xFF00, bootloader_read_status_16b_rdsr_rdsr2, bootloader_write_status_16b_wrsr, 9},

    /* Final entry is default entry, if no other IDs have matched.

       This approach works for chips including:
       GigaDevice (mfg ID 0xC8, flash IDs including 4016),
       FM25Q32 (QOUT mode only, mfg ID 0xA1, flash IDs including 4016)
       BY25Q32 (mfg ID 0x68, flash IDs including 4016)
    */
    {NULL, 0xFF, 0xFFFF, 0xFFFF, bootloader_read_status_8b_rdsr2, bootloader_write_status_8b_wrsr2, 1},
};

/**
 * @brief Enum for user to select valid wrap size.
 */
typedef enum
{
    FLASH_WRAP_SIZE_8B = 8,
    FLASH_WRAP_SIZE_16B = 16,
    FLASH_WRAP_SIZE_32B = 32,
    FLASH_WRAP_SIZE_64B = 64,
} spi_flash_wrap_size_t;

typedef enum
{
    CACHE_TYPE_DATA,
    CACHE_TYPE_INSTRUCTION,
    CACHE_TYPE_ALL // This means both ICache and DCache will be used. On some chips, I/D are controlled by a shared Cache. Also use this enum under this condition. See `SOC_SHARED_IDCACHE_SUPPORTED`.
} cache_type_t;

/**
 * Necessary hal contexts, could be maintained by upper layer in the future
 */
typedef struct
{
    bool i_autoload_en;
    bool d_autoload_en;
#if CACHE_LL_ENABLE_DISABLE_STATE_SW
    // There's no register indicating if cache is enabled on these chips, use sw flag to save this state.
    bool i_cache_enabled;
    bool d_cache_enabled;
#endif
} cache_hal_state_t;

typedef struct
{
    cache_hal_state_t l1;
    cache_hal_state_t l2;
} cache_hal_context_t;

#define CACHE_LL_L1_ICACHE_AUTOLOAD (1 << 2)
#define CACHE_LL_L1_DCACHE_AUTOLOAD (1 << 2)
#define CACHE_LL_ID_ALL 2        // All of the caches in a type and level, make this value greater than any id
#define CACHE_LL_LEVEL_INT_MEM 0 // Cache level for accessing internal mem
#define CACHE_LL_LEVEL_EXT_MEM 1 // Cache level for accessing external mem
#define CACHE_LL_LEVEL_ALL 2     // All of the cache levels, make this value greater than any level
#define CACHE_LL_LEVEL_NUMS 1    // Number of cache levels

/**
 * @brief Probe flash wrap method
 *
 * @param flash_id Flash chip ID
 *
 * @return ESP_OK: If succeed
 */
typedef esp_err_t (*spi_flash_wrap_probe_fn_t)(uint32_t flash_id);

/**
 * @brief Set flash wrap
 *
 * @param wrap_size: wrap_size
 *
 * @return ESP_OK: If succeed
 */
typedef esp_err_t (*spi_flash_wrap_set_fn_t)(spi_flash_wrap_size_t wrap_size);

/**
 * @brief Clear flash wrap.
 *
 * @return ESP_OK: If succeed
 */
typedef esp_err_t (*spi_flash_wrap_clr_fn_t)(void);

typedef struct __attribute__((packed))
{
    const char *method;
    spi_flash_wrap_probe_fn_t probe;
    spi_flash_wrap_set_fn_t chip_wrap_set;
    spi_flash_wrap_clr_fn_t chip_wrap_clr;
} spi_flash_wrap_info_t;

// clear bit or clear bits of register
#define REG_CLR_BIT(_r, _b)                                                  \
    do                                                                       \
    {                                                                        \
        *(volatile uint32_t *)(_r) = (*(volatile uint32_t *)(_r)) & (~(_b)); \
    } while (0)

#endif /* SPI_DRV_ESP32S3_PORTED_H_INCLUDED */